openFoamRepoDev/tutorials/lagrangian/reactingParcelFoam/cylinder/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    "(sides|frontAndBack)"
    {
        type            calculated;
        value           $internalField;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
